HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xd/IfxMultican.h
/** \brief Enables / Disables the transfer interrupt of CAN node x. \n
 * This interrupt is generated after the successful reception or transmission of a CAN frame in node x
 * \param hwNode Pointer to CAN Node registers
 * \param enabled Enable / disable choice
 * \return None
 */
IFX_INLINE void IfxMultican_Node_setTransferInterrupt(Ifx_CAN_N *hwNode, boolean enabled);

/** \brief Selects the interrupt output line INT_Om
 * (m = 0-15) for a transfer OK interrupt of CAN Node x.
 * \param hwNode Pointer to CAN Node registers
 * \param srcId Service request ID
 * \return None
 */
IFX_INLINE void IfxMultican_Node_setTransferInterruptPointer(Ifx_CAN_N *hwNode, IfxMultican_SrcId srcId);

/** \brief Sets the value of the transmit error counter of CAN node x.
 * \param hwNode Pointer to CAN Node registers
 * \param value Transmit error counter value
 * \return None
 */
IFX_INLINE void IfxMultican_Node_setTransmitErrorCounter(Ifx_CAN_N *hwNode, uint8 value);

/** \brief Return the DLC code corresponding to the data length in byte
 * \param dataLength Data length in bytes
 * \return Data length code
 */
IFX_INLINE IfxMultican_DataLengthCode IfxMultican_Node_getCodeFromDataLength(uint32 dataLength);

/** \brief Get the datalength in bytes from DLC
 * \param code Data length code
 * \return Datalength in bytes
 */
IFX_INLINE uint32 IfxMultican_Node_getDataLengthFromCode(IfxMultican_DataLengthCode code);

/******************************************************************************/
/*-------------------------Global Function Prototypes-------------------------*/
/******************************************************************************/

/** \brief Reset the CAN node
 * \param hwNode Pointer to CAN Node registers
 * \return None
 */
IFX_EXTERN void IfxMultican_Node_deinit(Ifx_CAN_N *hwNode);

/** \brief Select and initialise the CAN node receive pin
 * \param hwNode Pointer to CAN Node registers
 * \param rxd Rx pin
 * \param mode Input mode
 * \return TRUE: Returns TRUE if the operation was successful\n
 * FALSE: Returns FALSE if the operation was errorneous
 */
IFX_EXTERN boolean IfxMultican_Node_initRxPin(Ifx_CAN_N *hwNode, IfxMultican_Rxd_In *rxd, IfxPort_InputMode mode, IfxPort_PadDriver padDriver);

/** \brief Select and initialise the CAN node transmit pin
 * \param hwNode Pointer to CAN Node registers
 * \param txd Tx pin
 * \param mode Output mode
 * \return TRUE: Returns TRUE if the operation was successful\n
 * FALSE: Returns FALSE if the operation was errorneous
 */
IFX_EXTERN boolean IfxMultican_Node_initTxPin(Ifx_CAN_N *hwNode, IfxMultican_Txd_Out *txd, IfxPort_OutputMode mode, IfxPort_PadDriver padDriver);

/** \brief Recovers the CAN node from bus off
 * \param hwNode Pointer to CAN Node registers
 * \return Status
 */
IFX_EXTERN IfxMultican_Status IfxMultican_Node_recoverBusOff(Ifx_CAN_N *hwNode);

/** \brief Calculates the best posible values and configures BTR register
 * \param hwNode Pointer to CAN Node registers
 * \param moduleFreq Specifies the CAN module frequency
 * \param baudrate Specifies the node baud rate. Unit: baud
 * \param samplePoint Specifies the sample point. Range = [0, 10000] resp. [0%, 100%] of the total bit time.
 * \param synchJumpWidth synchJumpWidth Specifies the re-synchronization jump width.\n
 * Range = [0, 10000] resp. [0%, 100%] of the total bit time.
 * \return None
 */
IFX_EXTERN void IfxMultican_Node_setBitTiming(Ifx_CAN_N *hwNode, float32 moduleFreq, uint32 baudrate, uint16 samplePoint, uint16 synchJumpWidth);

/** \brief Returns the CAN node timing
 * \param moduleFreq Specifies the CAN module frequency
 * \param btr BTR
 * \param baudrate Baudrate
 * \param samplePoint Sample point
 * \param synchJumpWidth Sync Jump Width
 * \return None
 */
IFX_EXTERN void IfxMultican_calcTimingFromBTR(float32 moduleFreq, uint32 btr, uint32 *baudrate, uint16 *samplePoint, uint16 *synchJumpWidth);

/** \} */

/** \addtogroup IfxLld_Multican_Std_Message
 * \{ */

/******************************************************************************/
/*-------------------------Inline Function Prototypes-------------------------*/
/******************************************************************************/

/** \brief Initializes a CAN message
 * \param msg The message which should be initialized
 * \param id The message ID
 * \param dataLow The lower part of the 64bit data value
 * \param dataHigh The upper part of the 64bit data value
 * \param lengthCode number of bytes (data length code) which should be transmitted (0..8)
 * \return None
 */
IFX_INLINE void IfxMultican_Message_init(IfxMultican_Message *msg, uint32 id, uint32 dataLow, uint32 dataHigh, IfxMultican_DataLengthCode lengthCode);

/** \brief Initializes a CAN message long frame
 * \param msg The message which should be initialized
 * \param id The message ID
 * \param lengthCode number of bytes (data length code) which should be transmitted (0..8)
 * \param fastBitRate Fast bit rate (FCR.BRS) enable/ disable choice
 * \return None
 */
IFX_INLINE void IfxMultican_Message_longFrameInit(IfxMultican_Message *msg, uint32 id, IfxMultican_DataLengthCode lengthCode, boolean fastBitRate);

/** \} */

/** \addtogroup IfxLld_Multican_Std_Message_Objects
 * \{ */

/******************************************************************************/
/*-------------------------Inline Function Prototypes-------------------------*/
/******************************************************************************/

/** \brief Sets priority class of message object
 * \param hwObj Pointer to CAN message object registers
 * \return None
 */
IFX_INLINE void IfxMultican_MsgObj_clearDataRegisters(Ifx_CAN_MO *hwObj);

/** \brief Clears the FIFO/GateWay pointers of a message object
 * \param hwObj Pointer to CAN message object registers
 * \return None
 */
IFX_INLINE void IfxMultican_MsgObj_clearFifoGatewayPointers(Ifx_CAN_MO *hwObj);

/** \brief Clear the RX pending flag of a message object
 * \param hwObj Pointer to CAN message object registers
 * \return None
 */
IFX_INLINE void IfxMultican_MsgObj_clearRxPending(Ifx_CAN_MO *hwObj);

/** \brief Clear the TX pending flag of a message object
 * \param hwObj Pointer to CAN message object registers
 * \return None
 */
IFX_INLINE void IfxMultican_MsgObj_clearTxPending(Ifx_CAN_MO *hwObj);

/** \brief Gets bottom object pointer of the base message object
 * \param hwObj Pointer to CAN message object registers
 * \return Bottom message object number
 */
IFX_INLINE IfxMultican_MsgObjId IfxMultican_MsgObj_getBottomObjectPointer(Ifx_CAN_MO *hwObj);

